Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/starting_work_and_changing_job/training_and_looking_for_work/return_to_work.html.txt.tmx
Source language: en
Languages: ga

source: If you are returning to employment after a significant gap, there are a number of options to consider and steps you should take before you start work
ga: Má tá tú ag filleadh ar an bhfostaíocht tar éis a bheith díomhaoin fada go leor, tá roinnt roghanna le cur san áireamh agus bearta ba cheart duit a dhéanamh sula dtosaíonn tú ar an obair

source: You may need help with finding a job or you may be interested in further training before starting work
ga: B'fhéidir go dteastóidh cabhair uait le post a fháil nó gur suim leat oiliúint bhreise sula dtosaíonn tú ag obair

source: Your local Intreo Centre can advise you about job opportunities - see 'Where to apply' below
ga: Féadfaidh d’oifig seirbhísí fostaíochta áitiúil nó ionad Intreo comhairle a thabhairt duit faoi dheiseanna fostaíochta agus oiliúint - féach leat 'Cá háit a ndéanfaidh mé iarratas' anseo thíos

source: You can also check Jobs Ireland online for details of job vacancies and training courses
ga: Féadfaidh tú freisin dul i gcomhairle le Poist Éireann ar-líne le aghaidh mionsonraí faoi fholúntais i bpoist agus faoi chúrsaí oiliúna

source: The Department of Social Protection is responsible for providing employment services and guidance to jobseekers as well as income support
ga: Tá an Roinn Coimirce Sóisialaí freagrach as seirbhísí agus treoir fostaíochta a chur ar fáil do chuardaitheoirí poist mar aon le tacaíocht ioncaim

source: You can use a new Benefit of Work Ready Reckoner from the Department of Social Protection to help you assess out the financial consequences of taking up full-time work
ga: Is féidir an Réríomhán Tairbhe Oibre nua ón Roinn Coimirce Sóisialaí a úsáid. Cuidíonn sé leat iarmhairtí airgeadais a áirigh dá rachfá i mbun oibre lánaimseartha

source: The Reckoner works out the total amount you would receive on taking up full-time work (including any Family Income Supplement) and compares this to what you are getting in jobseeker payments (including Rent Supplement)
ga: Áiríonn an Réríomhán an méid iomlán (lena n-áirítear Forlíonadh Ioncaim Teaghlaigh) a gheofá dá rachfá i mbun oibre lánaimseartha agus cuireann sé é seo i gcomparáid leis an méid íocaíocht cuardaitheora poist (lena n-áirítear Forlíonadh Cíos) a fhaigheann tú

source: Intreo - the integrated employment and support service
ga: Intreo – an tseirbhís fhostaíochta agus tacaíochta comhtháite

source: Intreo, the new service from the Department of Social Protection, provides a single point of contact for all employment and income supports
ga: Seirbhís nua ón Roinn Coimirce Sóisialaí is ea Intreo a soláthróidh pointe teagmhála aonair le haghaidh iomlán tacaíochtaí fostaíochta ioncaim

source: Details of locations are published on welfare.ie
ga: Foilseoidh sonraí de na láithreacha ar welfare.ie

source: If you are unemployed you may be able to retain your medical card or Rent Supplement when you take up employment - see below
ga: Má tá tú dífhostaithe, b’fhéidir go mbeidh tú in ann do chárta leighis nó d’Fhorlíonadh Cíosa a choimeád nuair a ghlacann tú le fostaíocht – féach thíos

source: If you have been unemployed for some time and still have not found a job you may be eligible for an employment scheme
ga: Má bhí tú dífhostaithe ar feadh roinnt ama agus murar aimsigh tú post go fóill, d’fhéadfá bheith i dteideal páirt a ghlacadh i scéim fostaíochta

source: There are employment supports for people with disabilities
ga: Tá tacaíochtaí fostaíochta ann do dhaoine atá faoi mhíchumas

source: If you have children:
ga: Má tá leanaí agat:

source: • You may be eligible for a 13-week continued payment of the Increase for a Qualified Child
ga: • D’fhéadfá bheith i dteideal íocaíocht leantach 3 seachtaine a fháil den Mhéadú do Leanbh Cáilithe

source: Alternatively, if you are taking up a low-paid job, you may qualify for Family Income Supplement (FIS)
ga: Mar rogha air sin, má tá post ísealphá á fháil agat, b’fhéidir go gcáileoidh tú d’Fhorlíonadh Ioncam Teaghlaigh (FIT)

source: • The Back to Work Family Dividend is available for lone parent and long-term jobseeker families with children who find or return to work
ga: • Tá Díbhinn nua Teaghlaigh um Fhilleadh ar Obair ar fáil do theaghlaigh thuismitheoir aonair agus do theaghlaigh ina bhfuil cuardaitheoirí poist fadtéarmacha a bhfuil leanaí acu a aimsíonn obair nó a fhilleann ar obair

source: It can be paid in addition to FIS
ga: Féadtar í a íoc anuas ar FIT

source: • A number of affordable childcare schemes provide childcare for families on lower incomes and aim to support parents to return to work or education
ga: • Tá líon scéimeanna cúraim leanaí ar phraghas réasúnta ann, rud arb éard is sprioc dó aire a chur ar fáil do chlann na ndaoine atá ar bheagán ioncaim, sin agus tacú le tuismitheoirí ar mian leo filleadh ar a gcuid oibre

source: If you are returning to employment after a significant gap, you need to ensure that your tax and PRSI deductions from your wages are correct
ga: Má tá tú ag filleadh ar an bhfostaíocht tar éis a bheith díomhaoin fada go leor, ba cheart duit deimhin a dhéanamh de go bhfuil na hasbhaintí cánach agus ÁSPC a dhéantar ar do phá ceart

source: Your new employer must deduct tax and the Universal Social Charge (USC) from your pay under the PAYE system from the beginning of your employment
ga: Caithfidh d'fhostóir nua cáin agus an Muirear Sóisialta Uilíoch (MSU) a bhaint as do phá faoin gcóras ÍMAT ó thús do fhostaíocht

source: To make sure that your tax is properly dealt with from the start and that your employer deducts the right amount of tax from your pay, you should do the following:
ga: Chun a chinntiú go ndéileáiltear i gceart le do cháin ón tús agus go mbaineann do fhostóir an cháin cheart as do phá, ní mór duit na rudaí seo a dhéanamh:

source: • Give your employer your Personal Public Service Number (PPS number) and ask for your Employer's Registered Number
ga: • Tabhair d'Uimhir Pearsanta Seirbhís Poiblí (UPSP) - don fhostóir agus faigh a (h)uimhir chláraithe fostóra

source: If you do not know your PPS number, contact your Intreo Centre or Social Welfare Branch Office and staff there can find your number for you
ga: Muna bhfuil UPSP agat déan teagmháil le d’ionad Intreo nó oifig leasa shóisialaigh áitiúil agus déanfaidh an foireann d'uimhir a lorg

source: • Register the details of your new job with Revenue’s Jobs and Pensions online service in myAccount
ga: • Cláraigh sonraí do phost nua le seirbhís Poist agus Pinsean Revenue ar líne ag moChúrsaí – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: If you are unable to use online services, you can contact your tax office for assistance – see ‘Where to apply’ below
ga: Mura bhfuil tú in ann úsáid a bhaint as an seirbhísí ar líne, is féidir dul i dteagmháil le d’oifig cánach chun cabhair a fháil

source: Ideally you should take these steps as soon as you accept an offer of a job, even if only a part-time or holiday employment
ga: Bheadh sé níos fearr dá dtógfá na céimeanna seo chomh luath is a ghlacann tú le tairiscint poist, bíodh muna bhfuil ann ach obair pháirt-aimseartha nó obair shaoire

source: This will give your employment and the tax office time to get things sorted out before your first pay day
ga: Tabharfaidh sé seo deis don fhostóir agus don oifig chánach rudaí a fháil réitithe roimh do chéad lá pá

source: When you have registered the details of your new job, Revenue will send your employer a tax credit certificate showing the tax credits that your employer deducts from your tax bill
ga: Nuair tá sonraí do phost nua cláraithe agat, seolfaidh Revenue chuig d’fhostóir teastas a creidmheasanna cánach a léiríonn na creidmheasanna cánach a bhaineann d’fhostóir as do bhille cánach

source: You can view your tax credit certificate and claim any additional tax credits you may be due through Revenue's PAYE Anytime service
ga: Féadfaidh tú do theastas creidmheasanna cánach a fheiceáil agus aon chreidmheasanna breise dlite duit a éileamh tríd an tseirbhís Revenue Aon Tráth, Aon Lá

source: You access PAYE Anytime through Revenue's myAccount
ga: Is féidir téigh isteach i ÍMAT Aon Tráth, Aon Lá tríd an tSeirbhís moChúrsaí Revenue

source: If you have not sorted out your tax position by the time you start work your employer will have to deduct tax on an emergency basis
ga: Muna bhfuil cúrsaí cánacha réitithe amach agat faoin am a thosaíonn tú ag obair beidh ar d'fhostóir cáin a asbhaint are bhunús éigeandála

source: Providing your employer with your PPS number will allow your social welfare contributions to be recorded along with any contributions you paid in previous periods of employment
ga: Nuair a thugann tú dUPSP dod' fhostóir beidh do ranníocaíochtaí leasa shóisialaigh dhá gclárú in éineacht le aon ranníocaíochtaí a d'íoc tú i dtréimhsí fostaíochta roimhe seo

source: If you have been out of the workforce for some years, you will not qualify for short-term social welfare payments such as Illness Benefit immediately
ga: Má tá tú amuigh as an bhfórsa oibre le cúpla bliain anuas, níl tú i dteideal íocaíochtaí gearrthéarma leasa shóisialaigh cosúil le Sochar Breoiteachta láithreach

source: You are, however, immediately covered for Injury Benefit, where you are unable to work due to an accident at work
ga: Tá tú clúdaithe láithreach, áfach, i gcomhair sochar gortuithe, sa chás nach féidir leat obair mar thoradh ar thimpist ag an obair

source: How quickly you will qualify for the various social welfare benefits will depend on the type of benefit you are applying for and your circumstances before returning to work
ga: Braitheann sé ar cén cinéal sochair atá tú ag cur isteach air agus do chúinsí roimh duit filleadh ar an obair cé chomh luath agus a cháilíonn tú le haghaidh na sochair leasa shóisialaigh éagsúla

source: You gain credited contributions if, for example, you are sick or unemployed
ga: Tuilleann tú íocaíochtaí cridiúnaithe, má, mar shampla, tá tú tinn nó dífhostaithe

source: Retention of medical card and Rent Supplement
ga: Cárta leighis agus Fordheontas Cíosa a choinneáil

source: If you are unemployed and you are returning to full-time or part-time work, you can keep your medical card for 3 years provided you have been getting one of the following allowances or benefits for 12 months or more:
ga: Má tá tú dífhostaithe agus tú anois ag filleadh ar an obair go lánaimseartha nó go páirtaimseartha, féadfaidh tú do chárta leighis a choinneáil go ceann 3 bliana ar chuntar go bhfuil tú ag fáil ceann de na liúntais nó na sochair seo le 12 mhí nó níos faide:

source: • Have been on an employment incentive scheme or educational opportunity scheme
ga: • Go raibh tú ar scéim dhreasachta fostaíochta nó ar scéim dheiseanna oideachais

source: If you take up full-time employment you will retain your medical card for 3 years from the date you start work
ga: Má théann tú i mbun fostaíochta lánaimseartha coinneoidh tú do chárta leighis go ceann 3 bliana ón dáta ar thosaigh tú ar an obair

source: If you take up part-time employment the 3-year period starts from the date your income exceeds the relevant medical card guideline
ga: Má théann tú i mbun fostaíochta páirtaimseartha tosaíonn an tréimhse trí bliana an lá a sáraíonn d'ioncam an treoirlíne chuí don chárta leighis

source: There are further details about the retention of medical cards in the Health Service Executive's Medical Card/GP Visit National Assessment Guidelines (pdf)
ga: Tá tuilleadh sonraí faoi chárta leighis a choinneáil sa Teorainn Measúnachta Náisiúnta Cárta Leighis/Cárta Cuairte (pdf) na Feidhmeannachta na Seirbhíse Sláinte

source: If you have been unemployed or not in full-time employment for at least 12 months and are assessed as in need of housing under the Rental Accommodation Scheme you may be entitled to retain your Rent Supplement. Where to apply Your tax office
ga: Má tá tú dífhostaithe nó gan a bheith fostaithe go lánaimseartha le 12 mhí ar a laghad agus más é an measúnú ort go bhfuil tú i ngátar tithíochta de bhun na Scéime um Chóiríocht ar Cíos b'fhéidir go mbeidh tú i dteideal d'Fhordheontas Cíosa a choinneáil
